droplbox/Battery_Logger/stm32/batlogger/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DHTP_Pin GPIO_PIN_0
#define DHTP_GPIO_Port GPIOA
#define MAXSS_Pin GPIO_PIN_4
#define MAXSS_GPIO_Port GPIOA
#define SDSS_Pin GPIO_PIN_12
#define SDSS_GPIO_Port GPIOB
#define GLCD_SCK_Pin GPIO_PIN_8
#define GLCD_SCK_GPIO_Port GPIOA
#define GLCD_SID_Pin GPIO_PIN_9
#define GLCD_SID_GPIO_Port GPIOA
#define GLCD_CS_Pin GPIO_PIN_10
#define GLCD_CS_GPIO_Port GPIOA
#define GLCD_RST_Pin GPIO_PIN_15
#define GLCD_RST_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_4
#define LED_GPIO_Port GPIOB
#define BTN_Pin GPIO_PIN_5
#define BTN_GPIO_Port GPIOB
#define BTN_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */
#define SD_SPI_HANDLE hspi2
//#define SD_CS_PORT SDSS_GPIO_Port
//#define SD_CS_PIN SDSS_Pin
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
